//
//  DataSource.swift
//  WeaponsPerStage
//
//  Created by 南　京兵 on 2017/03/02.
//  Copyright © 2017年 南　京兵. All rights reserved.
//

import UIKit

class DataSource: NSObject {
    
    /// ステージデータ
    static let stageList = ["デカライン高架下", "ハコフグ倉庫", "シオノメ油田", "アロワナモール", "Bバスパーク", "モンガラキャンプ場", "ホッケふ頭", "モズク農園", "タチウオパーキング", "ネギトロ炭鉱", "マサバ海峡大橋", "ヒラメが丘団地", "キンメダイ美術館", "アンチョビットゲームズ", "ショッツル鉱山", "マヒマヒリゾート＆スパ"]
    
    /// 武器初期データ
    static var weaponsList = ["わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター"]
    
    /// サブ初期データ
    static var subWeaponsList = ["スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム"]
    
    /// スペシャル初期データ
    static var specialWeaponsList = ["バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア"]
    
    /// 武器種データ
    static let weaponType = ["シューター", "ブラスター", "スロッシャー", "ローラー", "筆", "スピナー", "チャージャー"]
}


