//
//  DataSource.swift
//  WeaponsPerStage
//
//  Created by 南　京兵 on 2017/03/02.
//  Copyright © 2017年 南　京兵. All rights reserved.
//

import UIKit

class DataSource: NSObject {
    
    /// ステージデータ
    static let stageList = ["デカライン高架下", "ハコフグ倉庫", "シオノメ油田", "アロワナモール", "Bバスパーク", "ホッケふ頭", "モズク農園", "ネギトロ炭鉱", "タチウオパーキング", "モンガラキャンプ場", "ヒラメが丘団地", "マサバ海峡大橋", "キンメダイ美術館", "マヒマヒリゾート＆スパ", "ショッツル鉱山", "アンチョビットゲームズ"]
    
    /// 武器初期データ
    static var weaponsList = ["わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター", "わかばシューター"]
    
    /// サブ初期データ
    static var subWeaponsList = ["スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム", "スプラッシュボム"]
    
    /// スペシャル初期データ
    static var specialWeaponsList = ["バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア", "バリア"]
}


